Revit 2027 API
FailuresAccessor.GetTransactionName Method
 Retrieves the name of the transaction for which failures are being processed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetTransactionName()
Public Function GetTransactionName As String
public:
String^ GetTransactionName()
member GetTransactionName : unit -> string
Return Value
String
 The name of the transaction for which failures are being processed.
Exceptions
Exception | Condition
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace